<?php
// +----------------------------------------------------------------------
// | 小黄牛MVC框架 - 我是Demo2的配置文件
// +----------------------------------------------------------------------
// | Copyright (c) 2016 www.junphp.com 
// +----------------------------------------------------------------------
// | Author: 冯俊豪 - 小黄牛 <1731223728@qq.com>
// +----------------------------------------------------------------------

return array(
	"DB_TYPE"          =>  "mysql",     		  	   // 数据库类型
	"DB_HOST"          =>  "localhost", 		   	   // 服务器地址
	"DB_NAME"          =>  "junphp",      		  	   // 数据库名
	"DB_USER"          =>  "root",   			  	   // 用户名
	"DB_PWD"           =>  "",       			  	   // 密码
	"DB_PORT"          =>  "3306",       		  	   // 端口
	"DB_PREFIX"        =>  "",    				  	   // 数据库表前缀
	"DB_CHARSET"       =>  "utf8",   			  	   // 数据库编码
);