<?php
/*
 +----------------------------------------------------------------------
 + Title        : PHP闭包与匿名函数
 + Author       : 小黄牛
 + Version      : V1.0.0.1
 + Initial-Time : 2017-5-16 16:30:00
 + Last-time    : 2017-5-16 16:30:00 + 小黄牛
 + Desc         : 简单定义一个闭包函数
 +    什么是闭包函数？即一个函数内部，包含了1-N个匿名函数，
 +    用处是可以做局部数据缓存与实现封装(有点类似class)
 +----------------------------------------------------------------------
*/

header("Content-type: text/html; charset=utf-8");

# 函数内部，定义一个匿名函数，即可称为闭包函数
function demo(){
    $func = function(){
        echo "我爱小黄牛";
    };
    $func();
}

# 调用测试下
demo();