<?php
/*
 +----------------------------------------------------------------------
 + Title        : PHP闭包与匿名函数
 + Author       : 小黄牛
 + Version      : V1.0.0.1
 + Initial-Time : 2017-5-16 17:05:00
 + Last-time    : 2017-5-16 17:05:00 + 小黄牛
 + Desc         : 如何使用闭包函数来进行父实例的变量自增
 +----------------------------------------------------------------------
*/

header("Content-type: text/html; charset=utf-8");

function demo(){
   $num  = 1;
   $func = function() use($num){
       echo $num;
       echo '<br/>';
       # 父类变量自增
       $num++;
   };
   return $func;
}

# 测试一下
$res = demo(); // 函数返回实例
$res();        // 理想中，它会输出1
$res();        // 理想中，它会输出2
$res();        // 理想中，它会输出3

# 运行上面的代码，我们发现它竟然没有像我们预想的那样，输出1/2/3，而且输出了三个1，原因很简单，因为闭包函数域的限制，通常情况下闭包函数是不能直接影响父函数的数据


# 隐藏上面的代码，我们再来试下
function demo(){
   $num  = 1;
   # 给use的变量加个&符合，就能改变对应参数的域的限制
   $func = function() use(&$num){
       echo $num;
       echo '<br/>';
       # 父类变量自增
       $num++;
   };
   return $func;
}

# 测试一下
$res = demo(); // 函数返回实例
$res();        // 理想中，它会输出1
$res();        // 理想中，它会输出2
$res();        // 理想中，它会输出3

# 成功了