<?php
// +----------------------------------------------------------------------
// | 小黄牛MVC框架 - 插件测试预览
// +----------------------------------------------------------------------
// | Copyright (c) 2016 www.junphp.com 
// +----------------------------------------------------------------------
// | Author: 冯俊豪 - 小黄牛 <1731223728@qq.com>
// +----------------------------------------------------------------------

header("Content-type:text/html;charset=utf-8");//设置页面编码
//引入Hooks核心类
include './Hooks.class.php';
$plugin=new Hooks();
//执行插件初始化
$plugin->hook();

//我是demo2 - 会员插件
$plugin->trigger('demo2');
//我是demo - 测试插件 ,我并不需要安装就可使用,并且不能禁用
$plugin->trigger('demo','我在动态调用,Demo测试插件的Ceshi方法!','Ceshi');