<?php
/*
 +----------------------------------------------------------------------
 + Title        : PHP7的一些新特征
 + Author       : 小黄牛
 + Version      : V1.0.0.1
 + Initial-Time : 2017-5-17 15:02:00
 + Last-time    : 2017-5-17 15:02:00 + 小黄牛
 + Desc         : 
 +     数组常量
 +     在PHP5.6时，以支持使用const 关键字定义数组常量
       但从PHP7开始，已经支持使用define()函数定义数组常量
 +----------------------------------------------------------------------
*/

# 我们来测试下
define('test', [
      '我',
      '爱',
      '小',
      '黄',
      '牛',
]);

echo '<pre>';
var_dump(test);
echo '</pre>';