<?php
/*
 +----------------------------------------------------------------------
 + Title        : PHP7的一些新特征
 + Author       : 小黄牛
 + Version      : V1.0.0.1
 + Initial-Time : 2017-5-17 15:42:00
 + Last-time    : 2017-5-17 15:42:00 + 小黄牛
 + Desc         : 
 +     PHP7新加了2个随机函数：
       random_bytes() - 生成加密安全伪随机字节。适合于使用来生成密码，密码学随机的任意长度的字符串，如：生成 salt，密钥或初始向量。
       random_int()   - 生成加密安全伪随机整数。
 +----------------------------------------------------------------------
*/

# 我们来测试下
echo bin2hex(random_bytes(5));
echo '<br/>';
echo random_int(1, 100);